{"card_name": "Ardy, Youthful Geomancer", "color": "RG", "rarity": "mythic", "type": "Legendary Planeswalker – Ardy", "number": 115, "color_identity": "RG", "cost": "{R}{G}", "rules_text": "Untap target land.\nExile the top card of your library. You may play that card until end of turn. If it’s a land card, you gain 2 life.\nUntap each land you control. Lands you control become 3/3 Elemental creatures with haste until end of turn. They’re still lands.         ", "pt": "", "special_text": "[+1]: Untap target land.\n[-1]: Exile the top card of your library. You may play that card until end of turn. If a land card is exiled this way, you gain 2 life.\n[-7]: Untap each land you control. Lands you control become 3/3 Elemental creatures with haste until end of turn. They’re still lands.        ", "shape": "planeswalker", "set": "ACR", "loyalty": "2", "notes": "!carpe\n\nHomeplane: Arcanum\nGender: Trans Male\nAge: 17\n\nBio: Ardy is a young planeswalker with a talent for geomancy. Born on the plane of Arcanum, he still lives there with his mother.\nHis parents have been seperated for several years now, due to the inherent tension between his father's desire to live a quiet life in the country and his mother's need for the hustle and bustle of the Arpechian Academy. While Ardy stayed with his mother, he still regularly visits his father.\nHis spark was ignited when he was fourteen, waking one night to the smell of smoke. By the time he realized what was happening and had woken his mother, the fire had trapped them. His sparks ignition whisked him away before the fire could reach him; and while his mother received burns severe enough to cause her to lose her arm (which she has since had a artificial replacement made for), she also managed to escape the fire via more mundane means.\nWorried about the dangers the Multiverse could hold for someone so young, Ardy's mother enlisted the help of another planeswalker who worked as a professor at the Arpechian Academy: Rahit. She convinced Ardy not to 'walk without Rahit's oversight, though as he's gotten older, he's been sneaking off on solo 'walks more and more. Meanwhile, his mother and Rahit have been growing closer, and recently Rahit has moved in with them.\n\nDesign Philosophy: As a bright and cheerful character, Ardy’s abilities should not be overly aggressive in nature. No burn, no fight, very limited destroy effects (if any). The abilities should also feel loose and full of potential, to reflect Ardy’s creative mindset.\nWith this particular card, the ult is about as aggressive as I’d be willing to go. Perhaps even too aggressive, but it does a good job of capturing Ardy’s occasional over-the-top showing off."}