{"card_name": "Rahit, Immaculate Architect", "color": "U", "rarity": "mythic", "type": "Legendary Planeswalker – Rahit", "number": 36, "color_identity": "U", "cost": "{1}{U}{U}", "rules_text": "Each player may draw a card. For each opponent that does, put a loyalty counter on Rahit.\nEach player draws three cards, then puts two cards from his or her hand on top of his or her library in any order.\nYou get an emblem with “Discard a card with converted mana cost X{:}{ }{C}{o}{u}{n}{t}{e}{r}{ }{t}{a}{r}{g}{e}{t}{ }{s}{p}{e}{l}{l}{ }{w}{i}{t}{h}{ }{c}{o}{n}{v}{e}{r}{t}{e}{d}{ }{m}{a}{n}{a}{ }{c}{o}{s}{t}{ }X or less.”", "pt": "", "special_text": "[+1]: Each player may draw a card. For each opponent that does, put a loyalty counter on Rahit.\n[-1]: Each player draws three cards, then puts two cards from their hand on top of their library in any order.\n[-6]: You get an emblem with “Discard a card with mana value X{:}{ }{C}{o}{u}{n}{t}{e}{r}{ }{t}{a}{r}{g}{e}{t}{ }{s}{p}{e}{l}{l}{ }{w}{i}{t}{h}{ }{m}{a}{n}{a}{ }{v}{a}{l}{u}{e}{ }X or less.”", "shape": "planeswalker", "set": "ACR", "loyalty": "3", "notes": "!carpe\n\nHomeplane: Kaladesh\nGender: Male\nAge: 34\n\nBio: A natural-born teacher, Rahit excells at guiding others and encouraging them to succeed. While his technical prowess was nothing remarkable, he had a knack for the manipulation of aether. However, an experiment gone wrong nearly cost him his life, only saved by the ignition of his spark.\nIn the years since, he has made Arcanum his home, becoming a well known face amidst the academics of the plane. Believing that all have the potential for greatness, no matter their walk of life, he hosts free to attend public lectures on a wide variety of topics when he’s not busy writing thesises.\n\nDesign Philosophy: Not being one interested in supremacy, his abilities should reflect his helpful, guiding nature. Effects should be group-hug in style. More specifically, letting everyone do the same thing, but with him doing it slightly better.\nIn terms of this particular card, the first two abilities reflect this idea fairly obviously. Less obvious is the ult, but when you get down to it, you and your opponent are both losing a CMC X card; you’re just in charge of when and how it happens."}