{"card_name": "Felice, Adira's Salvation", "color": "W", "rarity": "mythic", "type": "Legendary Planeswalker – Felice", "number": 9, "color_identity": "W", "cost": "{2}{W}{W}", "rules_text": "Each player can’t cast more than one spell until the start of your next turn.\nReturn each permanent card put into your graveyard from the battlefield since the end of your last turn to the battlefield tapped.", "pt": "", "special_text": "[+2]: Each player can’t cast more than one spell until your next turn.\n[-3]: Exile all other permanents, then return them to the battlefield tapped. Creatures can’t attack you or planeswalkers you control until your next turn.\n[-8]: Return all permanent cards from your graveyard to the battlefield tapped.", "shape": "planeswalker", "set": "ACR", "loyalty": "3", "notes": "!mac\n\nHomeplane: Adira\nGender: Female\nAge: 234\n\nBio: Felice's homeplane of Adira was slowly collapsing. In an attempt to save it, Felice went to the plane of Arcanum to study to try and find a way to fix it. Eventually she found something that might work - a method for immortality that she hoped to apply on a much larger scale - and went back to Adira. The solution was the pump the plane with so much stabilizing white mana that it stopped collapsing, and had the side effect of all but removing death from the plane. But it was a brittle fix, and as the strain on the fix increased so did the amount of mana necessary, until eventually even time on Adira (compared to the rest of the multiverse) slowed down. And so over the course of two centuries years normal time, Felice herself experience several thousand years, albeit in a fugue state. When Aerida supposedly killed Felice, the spell/fix broke, and all that pent up strain started tearing Adira apart faster than ever. Felice, however, survived, and after recovering, sought out Arcanum once more in search for another way to save her plane.\n\nDesign Philosophy: Much of Felice’s powers and ideals revolve around the idea of stabilization. In addition, a major theme of cheating death and immortality. Permanent reanimation is one of her hallmarks, in addition to general control elements."}