{"card_name": "Helene Trant", "color": "UG", "rarity": "mythic", "type": "Legendary Planeswalker – Helene", "number": 154, "color_identity": "UG", "cost": "{2}{G}{U}", "rules_text": "Until end of turn, Helene Trant becomes a 4/4 Human Warrior creature with indestructible that’s still a planeswalker. Prevent all damage that would be dealt to her this turn.\nDraw two cards.\nYou get an emblem with “Whenever one or more creatures you control deal combat damage to a player, draw a card.”", "pt": "", "special_text": "[+2]: Until end of turn, Helene Trant becomes a 4/4 Human Warrior creature with hexproof and trample that’s still a planeswalker. Prevent all damage that would be dealt to her this turn.\n[-2]: Draw two cards.\n[-4]: You get an emblem with “Whenever one or more creatures you control deal combat damage to a player, draw a card.”", "shape": "planeswalker", "set": "PFP", "loyalty": "4", "notes": "Homeplane: Bant\nGender: Female\nAge: 27 \n\nBio: Born on Bant, Helene was a Sigiled-cast knight, but only barely, and not for long. Her interest in strength over honour became more apparent over time, and she was stripped of her sigils and shamed by being reduced to Unbeholden-cast.\nShe wallowed in prison for a few years before the Conflux threw Alara into turmoil. With undead Grixis hordes and violent Jund hunters threatening the borders, Helene was released and armed once more, sent to help defend Bant in it’s desperate times. It eventually resulted in her spark being ignited, as a Grixis death mage attempted to drain away her vitality.\nWhen it did, Helene turned her back on her homeland, and struck out into the Multiverse. She took up the profession of mercenary, as a way to test her strength while also being rewarded for it.\n\nDesign Philosophy: Strength of body leads to strength of mind, and vice versa. This is the mentality that drives Helene, and mechanically results in a mix of aggressive abilities and card draw/filtering. Overall her cards should be aimed at midrange decks, and turn into a trampling indestructible creature as a + or 0.\n\n!escape\n\nv0.99\nyou draw a card, untap a land you control —> one or more creatures you control deal combat damage to a player, draw a card"}