{"card_name": "Kalemn Weller", "color": "B", "rarity": "mythic", "type": "Legendary Planeswalker – Kalemn", "number": 73, "color_identity": "B", "cost": "{1}{B}{B}", "rules_text": "Discard a card. If you do, each opponent discards a card and loses 1 life.\nDestroy target creature or planeswalker.\nDraw a card for each creature card and planeswalker card in all graveyards. Target opponent loses that much life.        ", "pt": "", "special_text": "[+1]: Discard a card. If you do, each opponent discards a card and loses 1 life.\n[-3]: Destroy target creature or planeswalker.\n[-7]: Draw a card for each creature card and planeswalker card in all graveyards. Target opponent loses that much life.", "shape": "planeswalker", "set": "PFP", "loyalty": "3", "notes": "Homeplane: Rhyse\nGender: Female\nAge: 23 \n\nBio: Kalemn was born into a clan of bandits, and as she grew up, was raised to steal. Starting with whisking sheep away in the dark of night, and then, once she could hold a sword, the classic pillaging and highway robbery. She never had any moral issues with it. She never really had moral issues with anything. She and the clan needed food and supplies, and they were strong enough to take them.\n\nHer spark remained latent until one particularly brave villager got the jump on her and shoved a torch into her face. After its ignition, faced with the grand scope of the Multiverse, she realized she was sick of preying on those living on the dirt just so that she in turn could live in the dirt. And so she changed her career to the slightly more illustrious role of a mercenary.\n\nHer potential for magic had remained unknown to her until her sparks ignition — due to Rhyse’s suppressing influence on magic — but since then she has slowly cultivated it. Her magical abilities start and end at the ability to manipulate flesh. She can rend flesh with a touch, though in her opinion the need to touch her victims means she might as well go the old fashioned route and stab them. She can heal wounds, though being a solo operator, it's mostly used to patch herself up after and/or during a fight. Finally, she can use it to make herself stronger, faster, and more durable.\n\nDesign Philosophy: Kalemn’s a straight forward woman. Not one for complicated schemes, most of her planning is composed of having a good idea of what fights to pick and what ones to avoid. As such, her abilities should be simple. Destructive in nature, since she makes a living killing people for coin.\n\n!escape"}